# Development tools
# Install with: brew bundle --file=install/Brewfile.dev

# Languages & runtimes
brew "go"
brew "protobuf"
brew "golangci-lint"


brew "rbenv"
brew "yarn"

# php
brew "php"
brew "composer"

# java
# LTS: 17, 21, 29 (2027)
brew "openjdk@21"
brew "jenv"

# Infrastructure
brew "terraform"
brew "docker"
brew "docker-completion"
brew "kubernetes-cli"
brew "kubectx"

# Testing & debugging
brew "testssl"
brew "wrk"
brew "asciinema"
brew "plantuml"

# Apps
cask "postman"
cask "charles"
cask "ngrok"
